In [1]:
import pandas as pd

# Добавление столбцов в DataFrame - методы assign() и insert() + concat()

    План урока
    
    - Добавление столбца в DataFrame
    - Добавление столбца с использованием скобочной нотации []
    - Метод assign()
    - Метод insert()
    - Функция concat( axis=1) - горизонтальная конкатенация
    - Добавление строки в DataFrame
    - Добавление строки с помощью .loc[]
    - Функция concat( axis=0) - вертикальная конкатенация

# Добавление столбца в DataFrame

## Использование квадратных скобок

In [2]:
df1 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
display(df1)


# присваиваем существующему столбцу A значение 0
df1['A'] = 0
display(df1)

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

       A   B   C
ONE    0  B1  C1
TWO    0  B2  C2
THREE  0  B3  C3

In [3]:
# создаем столбец 'D'  и присваиваем ему значение 0
df1['D'] = 0
df1

       A   B   C  D
ONE    0  B1  C1  0
TWO    0  B2  C2  0
THREE  0  B3  C3  0

In [4]:
# присвоение объекта типа массива
df1['E'] = [0, 1, 2]
df1

       A   B   C  D  E
ONE    0  B1  C1  0  0
TWO    0  B2  C2  0  1
THREE  0  B3  C3  0  2

In [5]:
# ValueError: Length of values does not match length of index
df1['F'] = [0, 1, 2, 3]

ValueError: Length of values (4) does not match length of index (3)

In [6]:
# присвоение значений серии s1 колонке 'A'

s1 = pd.Series(['A1','A2','A3'], index=['ONE', 'TWO', 'THREE'])
print(s1)
df1['A']=s1
df1

ONE      A1
TWO      A2
THREE    A3
dtype: object

        A   B   C  D  E
ONE    A1  B1  C1  0  0
TWO    A2  B2  C2  0  1
THREE  A3  B3  C3  0  2

In [7]:
df1['F'] = df1['B'] + df1['C']
df1['G'] = df1['B'].str.lower()
df1

        A   B   C  D  E     F   G
ONE    A1  B1  C1  0  0  B1C1  b1
TWO    A2  B2  C2  0  1  B2C2  b2
THREE  A3  B3  C3  0  2  B3C3  b3

In [8]:
s2 = pd.Series(['X2', 'X3', 'X4'], index=['TWO', 'THREE', 'FOUR'])
print(s2)

TWO      X2
THREE    X3
FOUR     X4
dtype: object

In [9]:
df1['H'] = s2
df1

        A   B   C  D  E     F   G    H
ONE    A1  B1  C1  0  0  B1C1  b1  NaN
TWO    A2  B2  C2  0  1  B2C2  b2   X2
THREE  A3  B3  C3  0  2  B3C3  b3   X3

    Атрибут values в Series возвращает массив. Элементы присваиваются по порядку, независимо от индекса. 
    Обратите внимание, что если количество элементов не совпадает с количеством строк, произойдет ошибка.

In [10]:
s2.values

array(['X2', 'X3', 'X4'], dtype=object)

In [11]:
df1['I'] = s2.values
df1

        A   B   C  D  E     F   G    H   I
ONE    A1  B1  C1  0  0  B1C1  b1  NaN  X2
TWO    A2  B2  C2  0  1  B2C2  b2   X2  X3
THREE  A3  B3  C3  0  2  B3C3  b3   X3  X4

## Метод assign()

In [12]:
df2 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
df2

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

In [13]:
# метод assign() возвращает новый объект, при этом исходный объект остается неизменным
display(df2.assign(A=0))
display(df2.assign(D=0))
df2

       A   B   C
ONE    0  B1  C1
TWO    0  B2  C2
THREE  0  B3  C3

        A   B   C  D
ONE    A1  B1  C1  0
TWO    A2  B2  C2  0
THREE  A3  B3  C3  0

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

In [14]:
# print(s2)
df3 = df2.assign(C='XXX',
                   D=0, E=[0, 1, 2],
                   F=s2, G=s2.values,
                   H=df2['A'] + df2['B'])
df3

        A   B    C  D  E    F   G     H
ONE    A1  B1  XXX  0  0  NaN  X2  A1B1
TWO    A2  B2  XXX  0  1   X2  X3  A2B2
THREE  A3  B3  XXX  0  2   X3  X4  A3B3

## Метод insert()

In [15]:
df4 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
s3 = pd.Series(['Y2', 'Y3', 'Y4'], index=['TWO', 'THREE', 'FOUR'])

df4.insert(2, 'X', 0)
df4

        A   B  X   C
ONE    A1  B1  0  C1
TWO    A2  B2  0  C2
THREE  A3  B3  0  C3

In [16]:
# изменения происходят в исходном объекте DataFrame
df4.insert(0, 'Y', s3)
df4

         Y   A   B  X   C
ONE    NaN  A1  B1  0  C1
TWO     Y2  A2  B2  0  C2
THREE   Y3  A3  B3  0  C3

- Чтобы указать конец в качестве позиции для нового столбца используйте функцию len(df.columns) или метод df.shape[1] для получения количества существующих столбцов.
- Присвоение существующего имени столбца в качестве второго аргумента приведет к ошибке. Хотя можно разрешить дублирование, установив для аргумента allow_duplicates значение True

In [17]:
df4.insert(10, 'Z', 10)
# IndexError: index 10 is out of bounds for axis 0 with size 5

# df4.insert(-1, 'Z', 10)
# ValueError: unbounded slice

IndexError: index 10 is out of bounds for axis 0 with size 5

In [ ]:
# df4.insert(0, 'Y', 10)
# ValueError: cannot insert Y, already exists

In [18]:
df4.insert(0, 'Y', 10, allow_duplicates=True)
df4

        Y    Y   A   B  X   C
ONE    10  NaN  A1  B1  0  C1
TWO    10   Y2  A2  B2  0  C2
THREE  10   Y3  A3  B3  0  C3

## Функция concat() + параметр axis=1 (горизонтальное объединение)

## Пример 1 - горизонтальное объединение DataFrame и Series

In [19]:
df5 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
s4 = pd.Series(['X2', 'X3', 'X4'], index=['TWO', 'THREE', 'FOUR'], name='NEW')

result_concat_1 = pd.concat([df5, s4], axis=1)
result_concat_1

         A    B    C  NEW
ONE     A1   B1   C1  NaN
TWO     A2   B2   C2   X2
THREE   A3   B3   C3   X3
FOUR   NaN  NaN  NaN   X4

## Пример 2 - горизонтальное объединение DataFrame и Series (только строки с общими индексами, используем параметр join='inner')

In [20]:
# чтобы сохранить только строки с общими индексами, мы указываем параметр join='inner'
result_concat_2 = pd.concat([df5, s4], axis=1, join='inner')
result_concat_2

        A   B   C NEW
TWO    A2  B2  C2  X2
THREE  A3  B3  C3  X3

## Пример 3 - горизонтальное объединение нескольких DataFrame и Series

In [21]:
df6 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
s_x = pd.Series(['X1', 'X2', 'X3'], index=df6.index, name='X')
s_y = pd.Series(['Y1', 'Y2', 'Y3'], index=df6.index, name='Y')
df7 = pd.DataFrame({'df_col1': 0, 'df_col2': range(3)}, index=df6.index)

result_concat_3=pd.concat([df6, s_x, s_y, df7], axis=1)
result_concat_3

        A   B   C   X   Y  df_col1  df_col2
ONE    A1  B1  C1  X1  Y1        0        0
TWO    A2  B2  C2  X2  Y2        0        1
THREE  A3  B3  C3  X3  Y3        0        2

# Добавление строк в DataFrame

## Добавление строки с использованием метода .loc[]

In [22]:
df8 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']},
                  index=['ONE', 'TWO', 'THREE'])
display(df8)


df8.loc['ONE'] = 0
df8

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

        A   B   C
ONE     0   0   0
TWO    A2  B2  C2
THREE  A3  B3  C3

In [23]:
df8.loc['FOUR'] = 0
df8.loc['FIVE'] = ['A5', 'B5', 'C5']
df8

        A   B   C
ONE     0   0   0
TWO    A2  B2  C2
THREE  A3  B3  C3
FOUR    0   0   0
FIVE   A5  B5  C5

In [24]:
df8.loc['SIX'] = ['A6', 'B6']
# ValueError: cannot set a row with mismatched columns

ValueError: cannot set a row with mismatched columns

In [25]:
s5 = pd.Series(['B6', 'C6', 'D6'], index=['B', 'C', 'D'])
s5

B    B6
C    C6
D    D6
dtype: object

In [26]:
s5.values

array(['B6', 'C6', 'D6'], dtype=object)

In [27]:
df8.loc['XXX'] = s5
df8.loc['YYY'] = s5.values
df8

         A   B   C
ONE      0   0   0
TWO     A2  B2  C2
THREE   A3  B3  C3
FOUR     0   0   0
FIVE    A5  B5  C5
XXX    NaN  B6  C6
YYY     B6  C6  D6

# Объединение нескольких объектов DataFrame и Series с помощью функции concat()

In [28]:
df9 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                    'B': ['B1', 'B2', 'B3'],
                    'C': ['C1', 'C2', 'C3']},
                   index=['ONE', 'TWO', 'THREE'])
display(df9)

df10 = pd.DataFrame({'B': ['B4', 'B5'], 'C': ['C4', 'C5'], 'D': ['D4', 'D5']},
                   index=['FOUR', 'FIVE'])
display(df10)


pd.concat([df9, df10])

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

       B   C   D
FOUR  B4  C4  D4
FIVE  B5  C5  D5

         A   B   C    D
ONE     A1  B1  C1  NaN
TWO     A2  B2  C2  NaN
THREE   A3  B3  C3  NaN
FOUR   NaN  B4  C4   D4
FIVE   NaN  B5  C5   D5

In [29]:
# чтобы сохранить только те столбцы, которые имеют общие имена, указываем join='inner'.

pd.concat([df9, df10], join='inner')

        B   C
ONE    B1  C1
TWO    B2  C2
THREE  B3  C3
FOUR   B4  C4
FIVE   B5  C5

## Будьте осторожны при конкатенировании DataFrame и Series

In [30]:
df11 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                    'B': ['B1', 'B2', 'B3'],
                    'C': ['C1', 'C2', 'C3']},
                   index=['ONE', 'TWO', 'THREE'])

s6 = pd.Series(['A4', 'B4', 'C4'], index=['A', 'B', 'C'], name='FOUR')
print(s6)

pd.concat([df11, s6])

A    A4
B    B4
C    C4
Name: FOUR, dtype: object

         A    B    C    0
ONE     A1   B1   C1  NaN
TWO     A2   B2   C2  NaN
THREE   A3   B3   C3  NaN
A      NaN  NaN  NaN   A4
B      NaN  NaN  NaN   B4
C      NaN  NaN  NaN   C4

## Используем метод to_frame + .T (транспонирование)

In [31]:
# серию превращаем в датафрейм, не забыв транспонировать
display(s6.to_frame().T)

# объединяем датафреймы в один
pd.concat([df11, s6.to_frame().T])

       A   B   C
FOUR  A4  B4  C4

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3
FOUR   A4  B4  C4